test/xml/get_shipment.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <wsc:SecurityContextToken xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc">
                <wsc:Identifier>bipro:7860072500822840554</wsc:Identifier>
            </wsc:SecurityContextToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <transfer:GetShipment xmlns:transfer="http://www.bipro.net/namespace/transfer">
            <transfer:Request>
                <allgemein:BiPROVersion xmlns:allgemein="http://www.bipro.net/namespace/allgemein">2.1.4.1.1</allgemein:BiPROVersion>
                <transfer:ConsumerID>2</transfer:ConsumerID>
                <transfer:ID>1</transfer:ID>
            </transfer:Request>
        </transfer:GetShipment>
    </soap:Body>
</soap:Envelope>